pd-comparison-analysis/bench7_3Dx8GPU_3Px8GPU_multimedia/coord/debugging/debug_run.log
podman run --rm -it \
  -e HF_TOKEN="$HF_TOKEN" \
  -v ~/.cache/sglang:/root/.cache \
  docker.io/lmsysorg/sglang:v0.5.14 \
  python -m sglang.bench_serving \
    --random-image-count \
    --model Qwen/Qwen3-VL-235B-A22B-Instruct \
    --num-prompts 10 \
    --dataset-name image \
    --random-input-len 300 \
    --random-output-len 200 \
    --image-count 3 \
    --image-resolution 1080p \
    --host host.containers.internal \
    --port 8080 \
    --backend sglang-oai-chat \
    --request-rate 10 \
    --ready-check-timeout-sec 0    



==========
== CUDA ==
==========

CUDA Version 13.0.1

Container image Copyright (c) 2016-2023, NVIDIA CORPORATION & AFFILIATES. All rights reserved.

This container image and its contents are governed by the NVIDIA Deep Learning Container License.
By pulling and using the container, you accept the terms and conditions of this license:
https://developer.nvidia.com/ngc/nvidia-deep-learning-container-license

A copy of this license is made available in this container at /NGC-DL-CONTAINER-LICENSE for your convenience.

WARNING: The NVIDIA Driver was not detected.  GPU functionality will not be available.
   Use the NVIDIA Container Toolkit to start this container with GPU support; see
   https://docs.nvidia.com/datacenter/cloud-native/ .

/usr/local/lib/python3.12/dist-packages/torch/cuda/__init__.py:61: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
/usr/local/lib/python3.12/dist-packages/torchao/quantization/quant_api.py:1731: SyntaxWarning: invalid escape sequence '\.'
  """Configuration class for applying different quantization configs to modules or parameters based on their fully qualified names (FQNs).
/sgl-workspace/sglang/python/sglang/srt/layers/attention/fla/utils.py:223: UserWarning: Triton is not supported on current platform, roll back to CPU.
  warnings.warn(
benchmark_args=Namespace(backend='sglang-oai-chat', base_url=None, host='host.containers.internal', port=8080, ready_check_timeout_sec=0, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct', served_model_name=None, tokenizer=None, num_prompts=10, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=300, random_output_len=200, random_range_ratio=0.0, image_count=3, image_resolution='1080p', random_image_count=True, image_format='jpeg', image_content='random', request_rate=10.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
config.json: 100%|████████████████████████████████████████████████████████████████████████████████████████████████████| 1.66k/1.66k [00:00<00:00, 1.97MB/s]
tokenizer_config.json: 100%|██████████████████████████████████████████████████████████████████████████████████████████| 10.9k/10.9k [00:00<00:00, 9.86MB/s]
vocab.json: 100%|██████████████████████████████████████████████████████████████████████████████████████████████████████| 2.78M/2.78M [00:07<00:00, 386kB/s]
merges.txt: 100%|██████████████████████████████████████████████████████████████████████████████████████████████████████| 1.67M/1.67M [00:06<00:00, 257kB/s]
tokenizer.json: 100%|██████████████████████████████████████████████████████████████████████████████████████████████████| 7.03M/7.03M [00:17<00:00, 397kB/s]
Namespace(backend='sglang-oai-chat', base_url=None, host='host.containers.internal', port=8080, ready_check_timeout_sec=0, dataset_name='image', dataset_path='', speed_bench_category=None, speed_bench_output_len=512, model='Qwen/Qwen3-VL-235B-A22B-Instruct', served_model_name=None, tokenizer=None, num_prompts=10, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=300, random_output_len=200, random_range_ratio=0.0, image_count=3, image_resolution='1080p', random_image_count=True, image_format='jpeg', image_content='random', request_rate=10.0, use_trace_timestamps=False, max_concurrency=None, output_file=None, output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, cache_report=False, seed=42, disable_ignore_eos=False, temperature=0.0, top_p=1.0, extra_request_body=None, apply_chat_template=True, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, gsp_group_distribution='uniform', gsp_zipf_alpha=None, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

preprocessor_config.json: 100%|████████████████████████████████████████████████████████████████████████████████████████████| 390/390 [00:00<00:00, 662kB/s]
chat_template.json: 100%|█████████████████████████████████████████████████████████████████████████████████████████████| 5.50k/5.50k [00:00<00:00, 3.58MB/s]
[transformers] The `use_fast` parameter is deprecated and will be removed in a future version. Use `backend="torchvision"` instead of `use_fast=True`, or `backend="pil"` instead of `use_fast=False`.
video_preprocessor_config.json: 100%|██████████████████████████████████████████████████████████████████████████████████████| 385/385 [00:00<00:00, 930kB/s]
#Input tokens: 48945
#Output tokens: 1030
#Total images: 23
#Images per request: min=1, max=3, mean=2.30

=== Token Breakdown (per request avg / total) ===
  Raw text prompt tokens (without overhead): avg=180.3, total=1803
  Text prompt tokens (with chat template): avg=197.9, total=1979
  Text prompt overhead: avg=17.6, total=176
  Vision tokens: avg=4696.6, total=46966

Created 10 random jpeg images with average 4806364 bytes per request
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 10/10 [00:36<00:00,  3.67s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang-oai-chat
Traffic request rate:                    10.0      
Max request concurrency:                 not set   
Successful requests:                     10        
Benchmark duration (s):                  37.19     
Total input tokens:                      48945     
Total input text tokens:                 1979      
Total input vision tokens:               46966     
Total generated tokens:                  1030      
Total generated tokens (retokenized):    846       
Request throughput (req/s):              0.27      
Input token throughput (tok/s):          1316.09   
Output token throughput (tok/s):         27.70     
Peak output token throughput (tok/s):    102.00    
Peak concurrent requests:                10        
Total token throughput (tok/s):          1343.79   
Concurrency:                             6.54      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   24337.40  
Median E2E Latency (ms):                 26076.40  
P90 E2E Latency (ms):                    35623.43  
P95 E2E Latency (ms):                    35671.81  
P99 E2E Latency (ms):                    35710.51  
---------------Time to First Token----------------
Mean TTFT (ms):                          21757.89  
Median TTFT (ms):                        24163.64  
P90 TTFT (ms):                           30866.41  
P95 TTFT (ms):                           31021.94  
P99 TTFT (ms):                           31146.37  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          22.55     
Median TPOT (ms):                        20.72     
P90 TPOT (ms):                           31.38     
P95 TPOT (ms):                           32.71     
P99 TPOT (ms):                           33.77     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           29.31     
Median ITL (ms):                         28.75     
P90 ITL (ms):                            40.04     
P95 ITL (ms):                            41.76     
P99 ITL (ms):                            81.81     
Max ITL (ms):                            1052.04   
==================================================